{
    "1": {
        "name": "Classic lasagna",
        "time": "40 min",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Mussels in shells (and without) - 100g",
            "tomato - 200g",
            "onion - 160g",
            "Lasagne sheets (8-10 pieces)",
            "garlic (2 cloves)",
            "Tomato paste - 60g",
            "cheese - 100g",
            "olive oil -  1 tablespoon",
            "butter - 50g",
            "milk - 600g",
            "wheat flour - 65g",
            "allspice - to taste"
        ],
        "smaller_img": "https://static.1000.menu/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1612884556_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1612884517_15_max.jpg",
        "steps": [
            "Prepare the ingredients: clean the mussels, chop the tomatoes, and peel the garlic.",
            "Fry the garlic and onions in olive oil until golden.",
            "Add the tomatoes, tomato paste, and allspice. Cook for 10 minutes.",
            "Boil the lasagna sheets according to the instructions.",
            "Layer the ingredients and lasagna sheets in a baking dish.",
            "Bake for 30 minutes at 180°C.",
            "Serve hot with grated cheese on top.",
            "Gradually pour in the milk, continuing to stir the mixture with a whisk to avoid lumps. Bring the mixture to the consistency of thick cream, remove from heat and cool.",
            "Grease the bottom of the baking dish with vegetable oil or cover with baking paper. Pour the Béchamel sauce over the bottom.",
            "The first layer should be lasagne sheets. If you are using a small form that has difficulty fitting the dry layer, it is better to hold the sheets in boiling water for about 2-3 minutes. This will make them soft and pliable and you can easily fit them into any form, and trim off the excess edges with a knife. Pour the sauce over the sheets again.",
            "Place the minced meat as the next layer and sprinkle it with lightly grated cheese.",
            "Pour the sauce over the mince. Lay out layers until the form is full. The last layer with sheets should be very well covered with sauce, especially the edges, otherwise there is a chance that the sheet of dough will dry out and burn during cooking.",
            "Sprinkle the final layer with grated cheese.",
            "Place the lasagna in the oven preheated to 190-200 degrees for 30-35 minutes. Make sure that the lasagna has an appetizing golden crust. Remove the finished dish from the oven and let it sit for about 10 minutes. Cut the lasagna into portions and arrange on plates. Serve hot. Enjoy!"
        ],
        "steps_images": [
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_2_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1584017693_3_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_4_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_5_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_6_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_7_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_8_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_9_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_10_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_11_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_12_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_14_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583924369_15_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1583911843_1_max.jpg"
        ]
    },
    "2": {
        "name": "Classic seafood paella",
        "time": "1 h",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Mussels in shells (and without) - 100g",
            "Squid carcass - 100 g",
            "Octopus - 100g",
            "Shrimp - 100g",
            "Rice (for paella) - 150g",
            "Tomatoes - 1",
            "Bell pepper - 1",
            "Onion - 1",
            "Garlic - 2 cloves",
            "Green peas - 120g",
            "Water (boiled water or fish broth) - 0.5l",
            "Dry spices (saffron, turmeric) - to taste",
            "Salt - to taste",
            "Olive oil - 60ml",
            "Lemons - 60g"
        ],
        "smaller_img": "https://static.1000.menu/img/content-v2/4a/4a/4542/paelya-s-moreproduktami-recept-s-foto_1602238125_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_18_max.jpg",
        "steps": [
            "How to make seafood paella? Prepare all the necessary ingredients. You don’t need to defrost the seafood in advance. If you can’t find a special rice variety for paella, take any round grain rice.",
            "Rinse the seafood under cold running water, then drain the excess water through a colander.",
            "Put the octopus, squid and mussels without shells in a separate container, you won’t need them yet.",
            "If you don’t have a paella frying pan, take any shallow one with a flat bottom. I used a frying pan with a diameter of 22 cm. Heat oil in the frying pan, put in the mussels and shrimp. If the shrimp are boiled, heat them for 1 minute and remove from the frying pan. If not, fry on both sides until cooked, until they turn orange. Remove the mussels from the frying pan when they open. Throw away the ones that haven't opened, you can't eat them.",
            "Peel the onion and garlic, wash them and cut them into small cubes. Put them in a frying pan and fry them over medium heat for 3-4 minutes until the onion is soft.",
            "Wash the tomato, remove the stem and cut it into random pieces. Add it to the onion and garlic. Stir and fry for 2 minutes.",
            "Then add the spices and stir.",
            "There is no need to rinse the rice. Add it to the frying pan. Stir until smooth and fry for a little, 1 or 2 minutes. You can reduce the heat so that the paella doesn't burn.",
            "Add hot water (or broth). Salt and stir until smooth. Simmer over medium heat for about 10 minutes. The liquid should evaporate by about half.",
            "Wash the bell pepper, remove the stem and seeds, cut it into small cubes. Add to the frying pan and distribute evenly.",
            "If there is too much liquid, increase the heat so that it evaporates faster. Cut the squid into rings or half rings. When the rice is already higher than the broth, add raw seafood. Simmer for another 2 minutes.",
            "Then add the peas, stir, taste. Add salt if necessary.",
            "When there is almost no broth left, turn off the stove, the paella is almost ready."
        ],
        "steps_images": [
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_1_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_2_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_3_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_4_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_5_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_6_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_7_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_8_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_9_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_10_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_11_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_12_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/4a/4a/4542/paelya-s-moreproduktami_1602493677_13_max.jpg"
        ]
    },
    "3": {
        "name": "Fresh Berry Tart",
        "time": "2 h",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Wheat flour - 350g",
            "Sugar - 50g",
            "Salt (a pinch) - to taste",
            "Butter - 200g",
            "Egg yolk - 1 pc",
            "Water - 60ml",
            "Filling:",
            "Cake cream mix (dry) - 100g",
            "Milk - 300ml",
            "Raspberries - 100g",
            "Strawberries - 150g",
            "Blackberries - 50g",
            "Blueberries - 100g"
        ],
        "smaller_img": "https://static.1000.menu/img/content/28746/tart-s-fruktami-i-suxim-zavarnym-kremom_1552086452_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content/28746/tart-s-fruktami-i-suxim-zavarnym-kremom_1540979209_1_max.jpg",
        "steps": [
            "Bake the tart base. Sift flour into a deep bowl, add sugar and salt. Mix dry ingredients.",
            "Cut frozen butter into small cubes. Add butter to dry ingredients, grind into crumbs.",
            "Place egg yolk in a bowl, pour in the specified amount of cold water, beat with a fork. Pour the resulting mixture into crumbs. Knead plastic dough.",
            "Place the dough in a suitable form, previously greased with vegetable oil. Spread in an even layer. Form a rim. Make holes with a fork over the entire surface of the base. Cover the base with cling film, put in the refrigerator for an hour.",
            "Preheat the oven to 200 degrees. Bake the base in it for 25 minutes until it becomes golden brown.",
            "Remove the pan with the base from the oven and leave for a while.",
            "Pour the dry cake cream into a saucepan and pour in 1/3 of the cold milk. Mix until smooth. The mixture should be lump-free.",
            "Pour the remaining 2/3 of the milk into a small saucepan. Put it on the fire and bring to a boil. Pour the boiling milk into the saucepan with the previously prepared mixture.",
            "Put the saucepan on the fire and bring the cream to a boil. Then cool the cream and beat it warm with a mixer until fluffy. Put the cream on the base. Smooth it out.",
            "Wash the strawberries, raspberries, blackberries and blueberries and dry them carefully. Cut the strawberries into thin slices. Decorate the pie with the berries and serve immediately. Enjoy"
        ],
        "steps_images": []
    },
    "4": {
        "name": "Chicken Kiev Cutlets",
        "time": "1h 30 min",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Chicken fillet - 700g",
            "Eggs - 2 pcs",
            "Butter - 100g",
            "Herbs - 20g",
            "Wheat flour - 4 tablespoons",
            "Breadcrumbs - 6 tablespoons",
            "Sunflower oil (for frying) - 400ml",
            "Black pepper (ground) - to taste",
            "Salt - to taste"
        ],
        "smaller_img": "https://static.1000.menu/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1628601955_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1616069228_18_max.jpg",
        "steps": [
            "How to make chicken Kiev cutlets from minced chicken? Prepare the ingredients. Chicken breast fillet is best for minced meat. Use any greens - I used parsley and dill. Remove the oil from the refrigerator about an hour before cooking - it should become soft. Choose high-quality and natural oil, without vegetable fats.",
            "Remove tough stems and wilted leaves from the greens, wash, dry and chop finely.",
            "Mix the chopped greens with soft butter. You should get a homogeneous mass. You can grind it with a blender. I just mixed it with a spoon.",
            "From the resulting mass, form a briquette, which can then be easily divided into 4 equal pieces (see step 7), and put it in the refrigerator or freezer. The resulting green butter filling should become hard.",
            "Prepare the minced meat. To do this, rinse the chicken fillet under running water and dry with paper towels to remove excess water. Then grind twice in a meat grinder with small or medium holes.",
            "Add salt and pepper to the mince.",
            "Knead the mince thoroughly until smooth, divide it into 4 equal parts and form a ball from each. Divide the cooled filling into 4 equal parts.",
            "For breading, pour flour and breadcrumbs into flat plates. For eggs, take a not very deep wide plate. Wash the eggs, wipe with a towel and beat with a whisk or fork until smooth. Do not beat until thick foam forms.",
            "Form cutlets. To do this, flatten the ball into a flat cake about 10 cm in diameter, put the filling in the middle and carefully pinch the edges to make an oblong cutlet. Then gently squeeze the cutlet with your palm from all sides so that the mince tightly wraps the filling.",
            "Dip the cutlet in flour from all sides.",
            "Transfer to a plate with beaten eggs and dip the cutlet on all sides.",
            "Then roll the cutlet in breadcrumbs. A strong multi-layer breading will prevent the oil from leaking out. This is very important, because if the oil leaks out, the taste of the cutlets will be spoiled. To be more sure, repeat steps 11 and 12 - dip the cutlet again first in the egg, and then in the breadcrumbs.",
            "Whatever deep-frying dish you take, pour in enough oil so that the cutlets are almost half-submerged in it. Heat the oil over medium heat, because working with hot oil is dangerous and you can burn yourself. To prevent the oil from splashing, you can add a pinch of salt to it, it will absorb any moisture. Lower the cutlets into the oil. Stir them with a slotted spoon so that they are evenly baked and do not stick to the bottom.",
            "If you see that the cutlets are darkening too quickly, reduce the heat. Fry them until golden brown on all sides. It took me about 2 minutes on each side. Place the finished cutlets in a heat-resistant form and put them in an oven preheated to 180 degrees for 15 minutes. There they will be completely cooked. Serve the Kiev cutlets with any side dish, always hot. Enjoy your meal!"
        ],
        "steps_images": [
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_15_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_16_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_17_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_18_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_19_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_20_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_21_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_22_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_23_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_24_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_25_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_26_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_27_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/df/25/51020/kotlety-po-kievski-iz-kurinogo-farsha_1604315333_28_max.jpg"
        ]
    },
    "5": {
        "name": "Chocolate fondant with liquid filling",
        "time": "30 min",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Dark chocolate - 150g",
            "Butter - 50g",
            "Wheat flour - 40g",
            "Sugar - 40g",
            "Eggs - 2 pcs",
            "Baking powder - 0.5 teaspoons",
            "Salt (a pinch) - 1g"
        ],
        "smaller_img": "https://static.1000.menu/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616476682_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_17_max.jpg",
        "steps": [
            "Prepare the necessary ingredients. Use large, high-quality eggs. Choose chocolate with at least 70% cocoa content for the best flavor. Use high-quality wheat flour.",
            "Melt the chocolate using a double boiler or microwave. Stir occasionally to ensure the chocolate melts evenly and doesn't stick to the sides. High-quality chocolate should be smooth, glossy, and uniform.",
            "Melt the butter and let it cool slightly.",
            "Pour the warm melted butter into the chocolate.",
            "Stir well until smooth. The mixture should be shiny and uniform.",
            "In a separate bowl, combine the eggs, sugar, and salt. Beat with a mixer until fluffy and homogeneous. It’s important for the sugar and salt to dissolve; otherwise, they will sink to the bottom and weigh down the batter. The mixture should lighten in color and retain plenty of bubbles on the surface.",
            "Add the chocolate-butter mixture to the whipped egg mixture and blend again until smooth.",
            "Sift the flour with baking powder and gradually add it to the chocolate mixture. You may need more or less flour depending on the batter's consistency.",
            "Mix the batter with a silicone spatula until you achieve a homogeneous, thick, but not overly dense consistency.",
            "Thoroughly grease the muffin molds with butter (even if they are silicone).",
            "Fill the molds with the chocolate batter. I had enough batter for exactly six molds.",
            "Place the fondants in a preheated oven at 200°C for 8-9 minutes. The exact time may vary depending on your oven, so it’s best to stay close. If you leave the fondants in for too long, the centers will bake through and lose their liquid consistency. When the surface slightly rises and forms a dome, remove the cakes from the oven and let them cool slightly in the molds.",
            "Carefully transfer the ready fondants to a plate and serve immediately, garnished with berries and mint. If desired, you can serve them with a scoop of vanilla ice cream. Enjoy your meal!"
        ],
        "steps_images": [
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_1_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_2_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_3_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_4_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_5_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_6_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_7_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_8_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_9_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_10_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_11_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_12_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/7a/08/11750/shokoladnyi-fondan-s-jidkoi-nachinkoi_1616477288_13_max.jpg"
        ]
    },
    "6": {
        "name": "Plov pig in castrum ready for breeding",
        "time": "1h 20 min",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Pork (pulp) - 500 g",
            "Rice - 250 g",
            "Carrot - 1 pc.",
            "Onion - 1 pc.",
            "Garlic - 2 cloves.",
            "Bay leaf - 1 pc.",
            "Vegetable oil - 2 tbsp.",
            "Dry spices (for pilaf) - 1 tsp.",
            "Ground black pepper - to taste",
            "Salt - to taste"
        ],
        "smaller_img": "https://static.1000.menu/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585366850_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_18_max.jpg",
        "steps": [
            "How to cook crumbly pork pilaf in a saucepan on the stove? First, prepare the necessary ingredients. For pilaf, usually use boneless pork. This can be a ham, neck, shoulder. I have a ham.",
            "Rinse the pork, dry it and cut into medium pieces.",
            "Wash the rice thoroughly until the water is clear. It is best to use special parboiled polished rice for pilaf. It does not boil over and keeps its shape well.",
            "Peel the carrots and cut into small strips.",
            "Peel the onion. Usually, the onion is added to pilaf cut into small cubes. I usually add the onion whole and throw it away at the very end.",
            "Heat the vegetable oil in a saucepan with a thick bottom. Put the pork and fry over high heat until golden brown. If your saucepan is small, it is better to fry the pork in several stages so that less moisture is released from it. Frying over high heat will help seal all the meat juices inside the pieces and the pork will retain its juiciness.",
            "Add spices and salt to the meat and stir quickly. It is advisable not to use enamel cookware for pilaf - it meat and spices can burn and stick to the bottom. And when trying to clean the bottom, you can damage the enamel. It is better to take stainless steel pans or pans with a non-stick coating.",
            "Add carrots to the meat and fry, stirring, over medium heat for 2-3 minutes. If you want to add chopped onion, you need to add it at this stage along with the carrots.",
            "Pour a glass of boiling water into the meat, add a whole onion, if you have not added it chopped before, and a bay leaf.",
            "Cover the pan with a lid and simmer over low heat for 20 minutes until the meat is soft and most of the liquid has evaporated.",
            "Pour washed rice on top of the meat and smooth it out. The rice should remain on top. There is no need to mix it with the meat.",
            "Pour hot water over the meat and rice so that the rice is completely covered by 1 cm of liquid. I used about one and a half cups of water. It is important that there is not too much water, because in this case it will take longer to evaporate, and the rice may boil over and lose its shape.",
            "Cover the pan with a lid again and simmer over low heat until the liquid evaporates, about 25-30 minutes. Do not stir the rice during this time.",
            "Mix the finished rice with the meat. Put the garlic cloves on top.",
            "Cover the pan with a lid again and let the pilaf sit for another 15 minutes. Enjoy!"
        ],
        "steps_images": [
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_1_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_2_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_3_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_4_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_5_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_6_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_7_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_8_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_9_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_10_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_11_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_12_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_13_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_14_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/9c/ce/20660/plov-v-kastrule-so-svininoi_1614404185_15_max.jpg"
        ]
    },
    "7": {
        "name": "Cream Cheesecake",
        "time": "3 h",
        "description": "Delicious, filling, aromatic. So good!",
        "ingredients": [
            "Shortbread cookies - 350g",
            "Butter (130g for the base and 20g for greasing the form) - 150g",
            "Filling:",
            "Cream cheese (I used Philadelphia) - 600g",
            "Heavy cream (33%) - 150ml",
            "Powdered sugar - 150g",
            "Eggs (Category CO) - 2 pcs",
            "Cornstarch - 40g",
            "Lemon juice - 20ml",
            "Vanilla (a pinch) - to taste"
        ],
        "smaller_img": "https://static.1000.menu/img/content-v2/19/17/44000/lazanya-klassicheskaya-s-farshem-v-duxovke_1612884556_prev_hor.jpg",
        "img": "https://static.1000.menu/res/640/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585366805_15_max.jpg",
        "steps": [
            "Prepare the necessary ingredients for the base. I used homemade cookies; they are more natural and tasty in my opinion. If you don’t have homemade ones, use your favorite shortbread cookies. Crush the cookies into crumbs. Optionally, you can replace one-third of the cookies with ground toasted walnuts or almonds for extra aroma and flavor. Melt the butter in the microwave and cool it to room temperature.",
            "Add the melted butter to the cookie crumbs and mix.",
            "Grease the sides of a springform pan (I used one with a 20 cm diameter) with butter, line the bottom with parchment paper, and grease it if necessary. Press the cookie and butter mixture into the pan, forming 7-8 mm thick sides. Place the pan in the freezer for about 20 minutes.",
            "Prepare the necessary ingredients for the filling. Take all the ingredients out of the fridge in advance; they should be at room temperature. Preheat the oven to 180°C, with top and bottom heating (no convection). Add powdered sugar to the cream cheese and stir with a spatula or spoon until the sugar dissolves and the mixture becomes smooth. I prefer powdered sugar because it dissolves faster than granulated sugar.",
            "Add the cream, eggs, vanilla, lemon juice, and cornstarch to the cream cheese mixture. Stir gently with a spatula, avoiding overmixing. If the mixture contains too much air, the cheesecake may puff up and crack during baking.",
            "Pour the filling into the pan. Spin the pan a few times to remove excess air and smooth the cheesecake's surface.",
            "Place a tray with water on the bottom level of the oven. Bake the cheesecake for 30 minutes at 180°C, then lower the temperature to 150°C and bake for another 30 minutes. Leave the cheesecake in the turned-off oven with the door slightly open for 1 hour. Remove the cheesecake from the oven and, once it is completely cool, wrap the top of the pan in plastic wrap and refrigerate overnight. Before serving, run a sharp knife along the edges of the pan, remove the parchment, and transfer the cheesecake to a plate. Enjoy!"
        ],
        "steps_images": [
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585315204_1_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585315204_2_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585315204_3_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585315204_4_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585315204_5_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585315204_6_max.jpg",
            "https://static.1000.menu/res/380/img/content-v2/ed/aa/44616/chizkeik-s-tvorojnym-syrom-s-vypechkoi_1585317057_7_max.jpg"
        ]
    }
}